## Logistic Regression
### used for binary classification

Logistic function is an S-shaped curve that can take any real-valued number and map it into a value between 0 and 1, but never exactly at those limits.

$a=w_{0} + w_{1}*x_{1} + w_{2}*x_{2} + ... + w_{n}*x_{n}$

$\hat{Y}=1/(1+e^{-a})$

Then cost function Cost(w), which derives how much the prediction is wrong compared to actual value.
Derivative of cost function
$\partial w$
for each iteration and the weights are updated.

$w_{i} = w_{j} - (\alpha * \partial w_{j}) $

Logistic regression calculates the conditional probability of a data belonging to either 1 or 0.

P greater than 0
${P}=e^(w_{0} + w_{1}*x_{1} + w_{2}*x_{2})$

P between 0 and 1
${P} e^(w_{0} + w_{1}*x_{1} + w_{2}*x_{2}) / e^(w_{0} + w_{1}*x_{1} + w_{2}*x_{2}) + 1$

dividing above equations we get

$1/1+e^(w_{0} + w_{1}*x_{1} + w_{2}*x_{2}+...) $

### Importing libraries

In [1]:
!ls

gender_submission.csv		   test.csv	train.csv
logistic_regression_titanic.ipynb  titanic.zip

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Data manipulation

In [88]:
train_df = pd.read_csv('train.csv')
X_test = pd.read_csv('test.csv')
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [89]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [38]:
train_df.drop(['PassengerId','Name','Ticket','Cabin'],axis=1, inplace=True)
train_df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [40]:
temp = train_df[['Survived', 'Sex']].groupby('Sex', as_index=False)['Survived'].sum()
temp

      Sex  Survived
0  female       233
1    male       109

In [41]:
temp = train_df[['Survived', 'Age']].groupby('Survived', as_index=False)['Age'].mean()
temp

   Survived        Age
0         0  30.626179
1         1  28.343690

In [42]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score, classification_report

In [64]:
train_df.dropna(subset=['Embarked'], inplace=True)
train_df.dropna(subset=['Age'], inplace=True)

In [65]:
le = LabelEncoder()
for i in ['Embarked','Sex']:
    train_df[i] = le.fit_transform(train_df[i])
train_df.head(8)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2
6         0       1    1  54.0      0      0  51.8625         2
7         0       3    1   2.0      3      1  21.0750         2
8         1       3    0  27.0      0      2  11.1333         2

### Splitting dataset

In [66]:
X = train_df.drop('Survived', axis=1)
y = train_df['Survived']
# X = train_df.iloc[:,1:1]
# y = train_df.iloc[0:]
X

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0         3    1  22.0      1      0    7.2500         2
1         1    0  38.0      1      0   71.2833         0
2         3    0  26.0      0      0    7.9250         2
3         1    0  35.0      1      0   53.1000         2
4         3    1  35.0      0      0    8.0500         2
6         1    1  54.0      0      0   51.8625         2
7         3    1   2.0      3      1   21.0750         2
8         3    0  27.0      0      2   11.1333         2
9         2    0  14.0      1      0   30.0708         0
10        3    0   4.0      1      1   16.7000         2
11        1    0  58.0      0      0   26.5500         2
12        3    1  20.0      0      0    8.0500         2
13        3    1  39.0      1      5   31.2750         2
14        3    0  14.0      0      0    7.8542         2
15        2    0  55.0      0      0   16.0000         2
16        3    1   2.0      4      1   29.1250         1
18        3    0  31.0      1      0   18.0000         2
20        2    1  35.0      0      0   26.0000         2
21        2    1  34.0      0      0   13.0000         2
22        3    0  15.0      0      0    8.0292         1
23        1    1  28.0      0      0   35.5000         2
24        3    0   8.0      3      1   21.0750         2
25        3    0  38.0      1      5   31.3875         2
27        1    1  19.0      3      2  263.0000         2
30        1    1  40.0      0      0   27.7208         0
33        2    1  66.0      0      0   10.5000         2
34        1    1  28.0      1      0   82.1708         0
35        1    1  42.0      1      0   52.0000         2
37        3    1  21.0      0      0    8.0500         2
38        3    0  18.0      2      0   18.0000         2
..      ...  ...   ...    ...    ...       ...       ...
856       1    0  45.0      1      1  164.8667         2
857       1    1  51.0      0      0   26.5500         2
858       3    0  24.0      0      3   19.2583         0
860       3    1  41.0      2      0   14.1083         2
861       2    1  21.0      1      0   11.5000         2
862       1    0  48.0      0      0   25.9292         2
864       2    1  24.0      0      0   13.0000         2
865       2    0  42.0      0      0   13.0000         2
866       2    0  27.0      1      0   13.8583         0
867       1    1  31.0      0      0   50.4958         2
869       3    1   4.0      1      1   11.1333         2
870       3    1  26.0      0      0    7.8958         2
871       1    0  47.0      1      1   52.5542         2
872       1    1  33.0      0      0    5.0000         2
873       3    1  47.0      0      0    9.0000         2
874       2    0  28.0      1      0   24.0000         0
875       3    0  15.0      0      0    7.2250         0
876       3    1  20.0      0      0    9.8458         2
877       3    1  19.0      0      0    7.8958         2
879       1    0  56.0      0      1   83.1583         0
880       2    0  25.0      0      1   26.0000         2
881       3    1  33.0      0      0    7.8958         2
882       3    0  22.0      0      0   10.5167         2
883       2    1  28.0      0      0   10.5000         2
884       3    1  25.0      0      0    7.0500         2
885       3    0  39.0      0      5   29.1250         1
886       2    1  27.0      0      0   13.0000         2
887       1    0  19.0      0      0   30.0000         2
889       1    1  26.0      0      0   30.0000         0
890       3    1  32.0      0      0    7.7500         1

[712 rows x 7 columns]

In [73]:
X_train, X_val, y_train, y_val = train_test_split(X, y, test_size=0.2, random_state=111)
# X_train

### Training a model

In [68]:
train_df.info()
# train_df.dropna(subset=['Age'], inplace=True)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 8 columns):
Survived    712 non-null int64
Pclass      712 non-null int64
Sex         712 non-null int64
Age         712 non-null float64
SibSp       712 non-null int64
Parch       712 non-null int64
Fare        712 non-null float64
Embarked    712 non-null int64
dtypes: float64(2), int64(6)
memory usage: 50.1 KB

In [69]:
classifier = LogisticRegression()
classifier.fit(X_train, y_train)
y_pred = classifier.predict(X_val)

/home/drex/.local/lib/python3.6/site-packages/sklearn/linear_model/_logistic.py:764: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

In [70]:
print(accuracy_score(y_val, y_pred))

0.8251748251748252

### Final classification report

In [71]:
print(classification_report(y_val, y_pred))

              precision    recall  f1-score   support

           0       0.79      0.92      0.85        78
           1       0.88      0.71      0.79        65

    accuracy                           0.83       143
   macro avg       0.84      0.82      0.82       143
weighted avg       0.83      0.83      0.82       143

### Testing the predicted model with test.csv

In [72]:
X_test.drop(['PassengerId','Name','Ticket','Cabin'],axis=1, inplace=True)
X_test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [82]:
X_test.dropna(subset=['Embarked'], inplace=True)
X_test.dropna(subset=['Age'], inplace=True)
X_test.dropna(subset=['Fare'], inplace=True)
le = LabelEncoder()
for i in ['Embarked','Sex']:
    X_test[i] = le.fit_transform(X_test[i])
X_test.head(8)

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  34.5      0      0   7.8292         1
1       3    0  47.0      1      0   7.0000         2
2       2    1  62.0      0      0   9.6875         1
3       3    1  27.0      0      0   8.6625         2
4       3    0  22.0      1      1  12.2875         2
5       3    1  14.0      0      0   9.2250         2
6       3    0  30.0      0      0   7.6292         1
7       2    1  26.0      1      1  29.0000         2

In [84]:
# X_test.info()
# 
y_pred = classifier.predict(X_test)

In [85]:
y_pred

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1,
       0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1,
       0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1,
       1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1,
       0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1,
       0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1,
       0])